Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/services_for_asylum_seekers_in_ireland/legal_aid_for_asylum_seekers_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Legal aid for asylum seekers
ga: Cúnamh dlí d'iarrthóirí tearmainn

source: Free legal aid is available to asylum seekers in Ireland through the Legal Aid Board to assist at all stages of the international protection process
ga: Tá cúnamh dlí saor in aisce ar fáil d'iarrthóirí tearmainn in Éirinn tríd an mBord um Chúnamh Dlíthiúil chun cabhrú i ngach stáid den phróiseas chosaint idirnáisiúnta

source: This includes at the time of the initial application, first interview and appeals
ga: Ina measc seo tá an chéad iarratas, an chéad agallamh agus achomhairc

source: Alternatively, you may also engage the services of a solicitor at your own expense
ga: Ar an láimh eile, d'fhéadfadh tú dlíodóir a fháil ar do chostas féin

source: You may also consult with the United Nations High Commissioner for Refugees
ga: Is féidir leat freisin dul i gcomhairle le hArd- Choimisinéir na Náisiún Aontaithe do Dhídeanaithe

source: The Legal Aid Board is an independent statutory body providing legal services in civil matters
ga: Is eagraíocht neamhspleách reachtúil é an Bord um Chúnamh Dlíthiúil a thugann seirbhísí dhlí ar chásanna sibhialta

source: The Irish Refugee Council Independent Law Centre provides early legal advice and representation to those in the early stages of the asylum process
ga: Soláthraíonn an Lárionad Dlí Neamhspleách an Chomhairle Dídeanaithe na hÉireann luathchomhairle dlíthiúil agus ionadaíocht dóibh siúd atá sna céimeanna luath na bpróiseas tearmainn

source: You should seek legal advice as early as possible in the process for asylum
ga: Ba chóir duit comhairle dlí a lorg chomh luath agus is féidir sa phróiseas tearmainn

source: Civil legal aid and advice for asylum seekers
ga: Seirbhísí comhairle agus cúnamh dlí d’iarrthóirí tearmainn

source: The Legal Aid Board provides confidential and independent legal services to persons applying for asylum in Ireland
ga: Is é An Bord um Chúnamh Dlíthiúil a sholáthraíonn seirbhísí dlíthiúla do dhaoine a dhéanann iarratas ar thearmann in Éirinn ar rúnda agus neamhspleách iad

source: The Board's civil legal aid and advice scheme will assist with applications for asylum or subsidiary protection and appeals to the Refugee Appeals Tribunal
ga: Beidh scéim chúnamh agus chomhairle dhlíthiúil shibhialta an Bhoird ag tabhairt cúnaimh d’iarratais ar thearmann nó ar chosaint choimhdeach agus ar achomhairc chun an Binse Achomhairc do Dhídeanaithe

source: It will not assist you with a judicial review of how the decision on your application was made but you might be able to get civil legal aid for that separately
ga: Ní thabharfaidh sé cúnamh duit le hathbhreithniú breithiúnach faoin gcaoi a ndearnadh an cinneadh i leith d’iarratais, ach b'fhéidir go mbeifeá in ann cúnamh dlíthiúil sibhialta a fháil dó sin ar leithligh

source: To apply for legal aid and advice you must fill in an application form – see ‘How to apply’ below
ga: Chun iarratas a dhéanamh ar chúnamh agus comhairle dhlíthiúil ní foláir duit foirm iarratas a chomhlánú – féach ‘An chaoi chun iarratas a dhéanamh’ thíos

source: To qualify for legal aid you must pass a means test - see 'Rules' below
ga: Ní mór duit teacht trí thástáil acmhainne chun cáiliú i gcomhair cúnaimh dhlíthiúil - féach 'Rialacha' thíos

source: A person who makes an application for legal services will be assisted as soon as possible
ga: Tabharfar cabhair chomh luath agus is féidir don duine a dhéanamh iarratas ar sheirbhísí dlíthiúla

source: The Legal Aid Board will provide assistance in the following way:
ga: Tabharfaidh an Bord um Chúnamh Dlíthiúil cabhair ar na bealaí seo a leanas:

source: • It will generally assist in applications for asylum by providing advice to you before you submit your questionnaire to the International Protection Office or before you attend your interview in the International Protection Office
ga: • Tabharfaidh sé cabhair go ginearálta leis na hiarratais ar tearmann trí comhairle a thabhairt dhuit sula ndéanann tú do cheistneoir a sheoladh chuig Oifig um Chosaint Idirnáisiúnta nó sula fhreastalaíonn tú ar agallamh in Oifig um Chosaint Idirnáisiúnta

source: • It can make written submissions to the International Protection Office in support of your application for asylum
ga: • Is féidir leis aighneachtaí scríofa a dhéanamh chuig Oifig um Chosaint Idirnáisiúnta ag tacú le do iarratas ar thearmann

source: • It can provide representation before the International Protection Appeals Tribunal
ga: • Is féidir leis ionadaíocht a dhéanamh ar do shon os comhair An Bínse Achomhairc i dtaobh Cosaint Idirnáisiúnta

source: • Where an application for refugee status is refused, it can assist generally in the submission of applications in accordance with the Immigration Act 1999 and matters arising from this submission
ga: • Áit a ndiúltaítear do iarratas ar dhídean, is féidir leis cabhrú go ginearálta le do iarratais ar chosanta coimhdí

source: To qualify for legal services, your income, less certain allowances, must be less than €18,000 and you must pay a minimum contribution of €10 for legal advice and, if you need it, legal aid
ga: Chun cáiliú do sheirbhísí dhlí, caithfidh do ioncaim, gan liúntaisí áirithe, a bheith níos lú ná €18,000 agus caithfidh tú an ranníocaíocht is ísle de €10 a dhéanamh ar chomhairle dlí agus, más gá duit, ar chúnamh dlí

source: People who are only receiving social welfare payments will generally be eligible for legal services at the minimum contribution
ga: Go ginearálta ní bheidh gá do dhaoine atá ag fáil íocaíochtaí leasa shóisialaigh ach an ranníocaíocht is ísle a íoc

source: People in Direct Provision may apply to have some of their contribution waived, which is at the discretion of the Legal Aid Board
ga: Is féidir le daoine atá ag fáil Soláthair Dhírigh iarratas a dhéanamh go n-ísleófaí a ranníocaíocht, ar dhiscréid An Bhoird um Chúnamh Dlíthiúil

source: Requirements of people seeking assistance
ga: Riachtanaisí iad siúd atá ag lorg cúnaimh

source: If you become a client of the Legal Aid Board you must:
ga: Má bhíonn tú i do chliant ag an mBord um Chúnamh Dlíthiúil, caithfidh tú:

source: • Keep the Legal Aid Board advised at all times of your current address
ga: • An Bord a choinneáil ar an eolas i gcónaí faoi do sheoladh reatha

source: • Attend at all appointments made for you with your caseworker or solicitor in the Legal Aid Board
ga: • Freastal ar choinní atá eagraithe duit le d'aturnae nó leis an oibrí sa mBord um Chúnamh Dlíthiúil atá ag plé le do chás

source: Strict limits apply at all stages of the asylum process and failure to attend appointments on time may result in the Legal Aid Board being unable to provide a service to you
ga: Tá teorainneacha déine i bhfeidhm ag chuile staid den phróiseas tearmainn agus má theipeann ort freastal ar choinní in am d'fhéadfadh sé cuir isteach ar an tseirbhís atá an Bord um Chúnamh Dlíthiúil ábalta a sholáthar duit

source: To apply for legal aid and advice to assist you with your asylum application, you fill in the application form and send it to the Smithfield Law Centre at the address below
ga: Chun iarratas a dhéanamh ar chúnamh agus comhairle dhlíthiúil chun cúnamh leat le d’iarratas ar thearmann, comhlánaigh an fhoirm iarratais seol í chuig Ionad Dlí Mhargadh na Feirme ag an seoladh thíos
